#### terraform plan every: aa9a351
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "spotify-line.moikilo00.net"
      + domain_validation_options = [
          + {
              + domain_name           = "spotify-line.moikilo00.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_domain_name.main will be created
  + resource "aws_api_gateway_domain_name" "main" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "spotify-line.moikilo00.net"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags_all                = (known after apply)

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-06-29T14:27:22.293+0000" -> (known after apply)
      ~ source_code_hash               = "1W0x+x+2+p2gwG4NMHkc3UCe5fO4qBxCfpQXjJaG7kQ=" -> "asNhDgDkqbpc5azxk7a1tJMukG42rzTWlrkXQDVWGJ4="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.spotify-line will be created
  + resource "aws_route53_record" "spotify-line" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "spotify-line.moikilo00.net"
      + type            = "A"
      + zone_id         = "Z04052072YGY8CIREK2A2"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.validations["spotify-line.moikilo00.net"] will be created
  + resource "aws_route53_record" "validations" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04052072YGY8CIREK2A2"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*